tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1778_tdd.h
#define COG1DBF_DBF5                  2207
#define COG1CON0                      2208
#define COG1CON0_MD                   2209
#define G1MD0                         2210
#define COG1CON0_MD0                  2211
#define G1MD                          2212
#define G1MD1                         2213
#define COG1CON0_MD1                  2214
#define G1MD2                         2215
#define COG1CON0_MD2                  2216
#define COG1CON0_CS0                  2217
#define G1CS                          2218
#define G1CS0                         2219
#define COG1CON0_CS                   2220
#define COG1CON0_CS1                  2221
#define G1CS1                         2222
#define G1LD                          2223
#define COG1CON0_LD                   2224
#define COG1CON0_EN                   2225
#define G1EN                          2226
#define COG1CON1                      2227
#define COG1CON1_POLA                 2228
#define G1POLA                        2229
#define COG1CON1_POLB                 2230
#define G1POLB                        2231
#define COG1CON1_POLC                 2232
#define G1POLC                        2233
#define COG1CON1_POLD                 2234
#define G1POLD                        2235
#define COG1CON1_FDBS                 2236
#define G1FDBS                        2237
#define COG1CON1_RDBS                 2238
#define G1RDBS                        2239
#define COG1RIS0                      2240
#define COG1RIS0_RIS0                 2241
#define G1RIS0                        2242
#define COG1RIS0_RIS1                 2243
#define G1RIS1                        2244
#define COG1RIS0_RIS2                 2245
#define G1RIS2                        2246
#define COG1RIS0_RIS3                 2247
#define G1RIS3                        2248
#define COG1RIS0_RIS4                 2249
#define G1RIS4                        2250
#define COG1RIS0_RIS5                 2251
#define G1RIS5                        2252
#define COG1RIS0_RIS6                 2253
#define G1RIS6                        2254
#define COG1RIS0_RIS7                 2255
#define G1RIS7                        2256
#define COG1RIS1                      2257
#define COG1RIS1_RIS8                 2258
#define G1RIS8                        2259
#define COG1RIS1_RIS9                 2260
#define G1RIS9                        2261
#define G1RIS10                       2262
#define COG1RIS1_RIS10                2263
#define G1RIS11                       2264
#define COG1RIS1_RIS11                2265
#define G1RIS12                       2266
#define COG1RIS1_RIS12                2267
#define G1RIS13                       2268
#define COG1RIS1_RIS13                2269
#define G1RIS14                       2270
#define COG1RIS1_RIS14                2271
#define G1RIS15                       2272
#define COG1RIS1_RIS15                2273
#define COG1RSIM0                     2274
#define G1RSIM0                       2275
#define COG1RSIM0_RSIM0               2276
#define G1RSIM1                       2277
#define COG1RSIM0_RSIM1               2278
#define G1RSIM2                       2279
#define COG1RSIM0_RSIM2               2280
#define G1RSIM3                       2281
#define COG1RSIM0_RSIM3               2282
#define G1RSIM4                       2283
#define COG1RSIM0_RSIM4               2284
#define G1RSIM5                       2285
#define COG1RSIM0_RSIM5               2286
#define G1RSIM6                       2287
#define COG1RSIM0_RSIM6               2288
#define G1RSIM7                       2289
#define COG1RSIM0_RSIM7               2290
#define COG1RSIM1                     2291
#define COG1RSIM1_RSIM8               2292
#define G1RSIM8                       2293
#define COG1RSIM1_RSIM9               2294
#define G1RSIM9                       2295
#define G1RSIM10                      2296
#define COG1RSIM1_RSIM10              2297
#define G1RSIM11                      2298
#define COG1RSIM1_RSIM11              2299
#define G1RSIM12                      2300
#define COG1RSIM1_RSIM12              2301
#define G1RSIM13                      2302
#define COG1RSIM1_RSIM13              2303
#define G1RSIM14                      2304
#define COG1RSIM1_RSIM14              2305
#define G1RSIM15                      2306
#define COG1RSIM1_RSIM15              2307
#define COG1FIS0                      2308
#define G1FIS0                        2309
#define COG1FIS0_FIS0                 2310
#define G1FIS1                        2311
#define COG1FIS0_FIS1                 2312
#define G1FIS2                        2313
#define COG1FIS0_FIS2                 2314
#define G1FIS3                        2315
#define COG1FIS0_FIS3                 2316
#define G1FIS4                        2317
#define COG1FIS0_FIS4                 2318
#define G1FIS5                        2319
#define COG1FIS0_FIS5                 2320
#define G1FIS6                        2321
#define COG1FIS0_FIS6                 2322
#define G1FIS7                        2323
#define COG1FIS0_FIS7                 2324
#define COG1FIS1                      2325
#define G1FIS8                        2326
#define COG1FIS1_FIS8                 2327
#define G1FIS9                        2328
#define COG1FIS1_FIS9                 2329
#define G1FIS10                       2330
#define COG1FIS1_FIS10                2331
#define G1FIS11                       2332
#define COG1FIS1_FIS11                2333
#define G1FIS12                       2334
#define COG1FIS1_FIS12                2335
#define G1FIS13                       2336
#define COG1FIS1_FIS13                2337
#define G1FIS14                       2338
#define COG1FIS1_FIS14                2339
#define G1FIS15                       2340
#define COG1FIS1_FIS15                2341
#define COG1FSIM0                     2342
#define COG1FSIM0_FSIM0               2343
#define G1FSIM0                       2344
#define COG1FSIM0_FSIM1               2345
#define G1FSIM1                       2346
#define COG1FSIM0_FSIM2               2347
#define G1FSIM2                       2348
#define COG1FSIM0_FSIM3               2349
#define G1FSIM3                       2350
#define COG1FSIM0_FSIM4               2351
#define G1FSIM4                       2352
#define COG1FSIM0_FSIM5               2353
#define G1FSIM5                       2354
#define COG1FSIM0_FSIM6               2355
#define G1FSIM6                       2356
#define COG1FSIM0_FSIM7               2357
#define G1FSIM7                       2358
#define COG1FSIM1                     2359
#define COG1FSIM1_FSIM8               2360
#define G1FSIM8                       2361
#define COG1FSIM1_FSIM9               2362
#define G1FSIM9                       2363
#define COG1FSIM1_FSIM10              2364
#define G1FSIM10                      2365
#define COG1FSIM1_FSIM11              2366
#define G1FSIM11                      2367
#define COG1FSIM1_FSIM12              2368
#define G1FSIM12                      2369
#define COG1FSIM1_FSIM13              2370
#define G1FSIM13                      2371
#define COG1FSIM1_FSIM14              2372
#define G1FSIM14                      2373
#define COG1FSIM1_FSIM15              2374
#define G1FSIM15                      2375
#define COG1ASD0                      2376
#define COG1ASD0_ASDAC0               2377
#define G1ASDAC0                      2378
#define COG1ASD0_ASDAC                2379
#define G1ASDAC                       2380
#define COG1ASD0_ASDAC1               2381
#define G1ASDAC1                      2382
#define G1ASDBD0                      2383
#define COG1ASD0_ASDBD0               2384
#define G1ASDBD                       2385
#define COG1ASD0_ASDBD                2386
#define G1ASDBD1                      2387
#define COG1ASD0_ASDBD1               2388
#define G1ASREN                       2389
#define COG1ASD0_ARSEN                2390
#define G1ARSEN                       2391
#define COG1ASD0_ASREN                2392
#define COG1ASD0_ASE                  2393
#define G1ASE                         2394
#define COG1ASD1                      2395
#define COG1ASD1_AS0E                 2396
#define G1AS0E                        2397
#define G1AS1E                        2398
#define COG1ASD1_AS1E                 2399
#define COG1ASD1_AS2E                 2400
#define G1AS2E                        2401
#define COG1ASD1_AS3E                 2402
#define G1AS3E                        2403
#define G1AS4E                        2404
#define COG1ASD1_AS4E                 2405
#define G1AS5E                        2406
#define COG1ASD1_AS5E                 2407
#define G1AS6E                        2408
#define COG1ASD1_AS6E                 2409
#define G1AS7E                        2410
#define COG1ASD1_AS7E                 2411
#define COG1STR                       2412
#define G1STRA                        2413
#define COG1STR_STRA                  2414
#define G1STRB                        2415
#define COG1STR_STRB                  2416
#define G1STRC                        2417
#define COG1STR_STRC                  2418
#define G1STRD                        2419
#define COG1STR_STRD                  2420
#define COG1STR_SDATA                 2421
#define G1SDATA                       2422
#define COG1STR_SDATB                 2423
#define G1SDATB                       2424
#define COG1STR_SDATC                 2425
#define G1SDATC                       2426
#define COG1STR_SDATD                 2427
#define G1SDATD                       2428
#define COG2PHR                       2429
#define G2PHR0                        2430
#define COG2PHR_PHR                   2431
#define COG2PHR_PHR0                  2432
#define G2PHR1                        2433
#define COG2PHR_PHR1                  2434
#define G2PHR2                        2435
#define COG2PHR_PHR2                  2436
#define G2PHR3                        2437
#define COG2PHR_PHR3                  2438
#define G2PHR4                        2439
#define COG2PHR_PHR4                  2440
#define G2PHR5                        2441
#define COG2PHR_PHR5                  2442
#define COG2PHF                       2443
#define COG2PHF_PHF                   2444
#define COG2PHF_PHF0                  2445
#define G2PHF0                        2446
#define COG2PHF_PHF1                  2447
#define G2PHF1                        2448
#define COG2PHF_PHF2                  2449
#define G2PHF2                        2450
#define G2PHF3                        2451
#define COG2PHF_PHF3                  2452
#define COG2PHF_PHF4                  2453
#define G2PHF4                        2454
#define COG2PHF_PHF5                  2455
#define G2PHF5                        2456
#define COG2BLKR                      2457
#define G2BLKR0                       2458
#define COG2BLKR_BLKR                 2459
#define COG2BLKR_BLKR0                2460
#define G2BLKR1                       2461
#define COG2BLKR_BLKR1                2462
#define G2BLKR2                       2463
#define COG2BLKR_BLKR2                2464
#define G2BLKR3                       2465
#define COG2BLKR_BLKR3                2466
#define G2BLKR4                       2467
#define COG2BLKR_BLKR4                2468
#define G2BLKR5                       2469
#define COG2BLKR_BLKR5                2470
#define COG2BLKF                      2471
#define COG2BLKF_BLKF                 2472
#define G2BLKF0                       2473
#define COG2BLKF_BLKF0                2474
#define COG2BLKF_BLKF1                2475
#define G2BLKF1                       2476
#define COG2BLKF_BLKF2                2477
#define G2BLKF2                       2478
#define COG2BLKF_BLKF3                2479
#define G2BLKF3                       2480
#define COG2BLKF_BLKF4                2481
#define G2BLKF4                       2482
#define COG2BLKF_BLKF5                2483
#define G2BLKF5                       2484
#define COG2DBR                       2485
#define COG2DBR_DBR0                  2486
#define G2DBR0                        2487
#define COG2DBR_DBR                   2488
#define COG2DBR_DBR1                  2489
#define G2DBR1                        2490
#define COG2DBR_DBR2                  2491
#define G2DBR2                        2492
#define COG2DBR_DBR3                  2493
#define G2DBR3                        2494
#define COG2DBR_DBR4                  2495
#define G2DBR4                        2496
#define COG2DBR_DBR5                  2497
#define G2DBR5                        2498
#define COG2DBF                       2499
#define G2DBF                         2500
#define G2DBF0                        2501
#define COG2DBF_DBF0                  2502
#define G2DBF1                        2503
#define COG2DBF_DBF1                  2504
#define G2DBF2                        2505
#define COG2DBF_DBF2                  2506
#define G2DBF3                        2507
#define COG2DBF_DBF3                  2508
#define G2DBF4                        2509
#define COG2DBF_DBF4                  2510
#define G2DBF5                        2511
#define COG2DBF_DBF5                  2512
#define COG2CON0                      2513
#define COG2CON0_MD0                  2514
#define G2MD                          2515
#define G2MD0                         2516
#define COG2CON0_MD                   2517
#define COG2CON0_MD1                  2518
#define G2MD1                         2519
#define COG2CON0_MD2                  2520
#define G2MD2                         2521
#define G2CS                          2522
#define COG2CON0_CS                   2523
#define COG2CON0_CS0                  2524
#define G2CS0                         2525
#define COG2CON0_CS1                  2526
#define G2CS1                         2527
#define COG2CON0_LD                   2528
#define G2LD                          2529
#define G2EN                          2530
#define COG2CON0_EN                   2531
#define COG2CON1                      2532
#define G2POLA                        2533
#define COG2CON1_POLA                 2534
#define G2POLB                        2535
#define COG2CON1_POLB                 2536
#define G2POLC                        2537
#define COG2CON1_POLC                 2538
#define G2POLD                        2539
#define COG2CON1_POLD                 2540
#define COG2CON1_FDBS                 2541
#define G2FDBS                        2542
#define G2RDBS                        2543
#define COG2CON1_RDBS                 2544
#define COG2RIS0                      2545
#define G2RIS0                        2546
#define COG2RIS0_RIS0                 2547
#define G2RIS1                        2548
#define COG2RIS0_RIS1                 2549
#define G2RIS2                        2550
#define COG2RIS0_RIS2                 2551
#define G2RIS3                        2552
#define COG2RIS0_RIS3                 2553
#define G2RIS4                        2554
#define COG2RIS0_RIS4                 2555
#define G2RIS5                        2556
#define COG2RIS0_RIS5                 2557
#define G2RIS6                        2558
#define COG2RIS0_RIS6                 2559
#define G2RIS7                        2560
#define COG2RIS0_RIS7                 2561
#define COG2RIS1                      2562
#define COG2RIS1_RIS8                 2563
#define G2RIS8                        2564
#define COG2RIS1_RIS9                 2565
#define G2RIS9                        2566
#define COG2RIS1_RIS10                2567
#define G2RIS10                       2568
#define COG2RIS1_RIS11                2569
#define G2RIS11                       2570
#define COG2RIS1_RIS12                2571
#define G2RIS12                       2572
#define COG2RIS1_RIS13                2573
#define G2RIS13                       2574
#define COG2RIS1_RIS14                2575
#define G2RIS14                       2576
#define COG2RIS1_RIS15                2577
#define G2RIS15                       2578
#define COG2RSIM0                     2579
#define G2RSIM0                       2580
#define COG2RSIM0_RSIM0               2581
#define G2RSIM1                       2582
#define COG2RSIM0_RSIM1               2583
#define G2RSIM2                       2584
#define COG2RSIM0_RSIM2               2585
#define G2RSIM3                       2586
#define COG2RSIM0_RSIM3               2587
#define G2RSIM4                       2588
#define COG2RSIM0_RSIM4               2589
#define G2RSIM5                       2590
#define COG2RSIM0_RSIM5               2591
#define G2RSIM6                       2592
#define COG2RSIM0_RSIM6               2593
#define G2RSIM7                       2594
#define COG2RSIM0_RSIM7               2595
#define COG2RSIM1                     2596
#define G2RSIM8                       2597
#define COG2RSIM1_RSIM8               2598
#define G2RSIM9                       2599
#define COG2RSIM1_RSIM9               2600
#define COG2RSIM1_RSIM10              2601
#define G2RSIM10                      2602
#define COG2RSIM1_RSIM11              2603
#define G2RSIM11                      2604
#define COG2RSIM1_RSIM12              2605
#define G2RSIM12                      2606
#define COG2RSIM1_RSIM13              2607
#define G2RSIM13                      2608
#define COG2RSIM1_RSIM14              2609
#define G2RSIM14                      2610
#define COG2RSIM1_RSIM15              2611
#define G2RSIM15                      2612
#define COG2FIS0                      2613
#define G2FIS0                        2614
#define COG2FIS0_FIS0                 2615
#define G2FIS1                        2616
#define COG2FIS0_FIS1                 2617
#define G2FIS2                        2618
#define COG2FIS0_FIS2                 2619
#define G2FIS3                        2620
#define COG2FIS0_FIS3                 2621
#define G2FIS4                        2622
#define COG2FIS0_FIS4                 2623
#define G2FIS5                        2624
#define COG2FIS0_FIS5                 2625
#define G2FIS6                        2626
#define COG2FIS0_FIS6                 2627
#define G2FIS7                        2628
#define COG2FIS0_FIS7                 2629
#define COG2FIS1                      2630
#define G2FIS8                        2631
#define COG2FIS1_FIS8                 2632
#define G2FIS9                        2633
#define COG2FIS1_FIS9                 2634
#define COG2FIS1_FIS10                2635
#define G2FIS10                       2636
#define COG2FIS1_FIS11                2637
#define G2FIS11                       2638
#define COG2FIS1_FIS12                2639
#define G2FIS12                       2640
#define COG2FIS1_FIS13                2641
#define G2FIS13                       2642
#define COG2FIS1_FIS14                2643
#define G2FIS14                       2644
#define COG2FIS1_FIS15                2645
#define G2FIS15                       2646
#define COG2FSIM0                     2647
#define COG2FSIM0_FSIM0               2648
#define G2FSIM0                       2649
#define COG2FSIM0_FSIM1               2650
#define G2FSIM1                       2651
#define COG2FSIM0_FSIM2               2652
#define G2FSIM2                       2653
#define COG2FSIM0_FSIM3               2654
#define G2FSIM3                       2655
#define G2FSIM4                       2656
#define COG2FSIM0_FSIM4               2657
#define G2FSIM5                       2658
#define COG2FSIM0_FSIM5               2659
#define COG2FSIM0_FSIM6               2660
#define G2FSIM6                       2661
#define G2FSIM7                       2662
#define COG2FSIM0_FSIM7               2663
#define COG2FSIM1                     2664
#define G2FSIM8                       2665
#define COG2FSIM1_FSIM8               2666
#define G2FSIM9                       2667
#define COG2FSIM1_FSIM9               2668
#define G2FSIM10                      2669
#define COG2FSIM1_FSIM10              2670
#define G2FSIM11                      2671
#define COG2FSIM1_FSIM11              2672
#define G2FSIM12                      2673
#define COG2FSIM1_FSIM12              2674
#define G2FSIM13                      2675
#define COG2FSIM1_FSIM13              2676
#define G2FSIM14                      2677
#define COG2FSIM1_FSIM14              2678
#define G2FSIM15                      2679
#define COG2FSIM1_FSIM15              2680
#define COG2ASD0                      2681
#define COG2ASD0_ASDAC0               2682
#define G2ASDAC                       2683
#define COG2ASD0_ASDAC                2684
#define G2ASDAC0                      2685
#define COG2ASD0_ASDAC1               2686
#define G2ASDAC1                      2687
#define COG2ASD0_ASDBD                2688
#define G2ASDBD0                      2689
#define COG2ASD0_ASDBD0               2690
#define G2ASDBD                       2691
#define G2ASDBD1                      2692
#define COG2ASD0_ASDBD1               2693
#define G2ARSEN                       2694
#define COG2ASD0_ARSEN                2695
#define COG2ASD0_ASREN                2696
#define G2ASREN                       2697
#define COG2ASD0_ASE                  2698
#define G2ASE                         2699
#define COG2ASD1                      2700
#define COG2ASD1_AS0E                 2701
#define G2AS0E                        2702
#define G2AS1E                        2703
#define COG2ASD1_AS1E                 2704
#define COG2ASD1_AS2E                 2705
#define G2AS2E                        2706
#define G2AS3E                        2707
#define COG2ASD1_AS3E                 2708
#define COG2ASD1_AS4E                 2709
#define G2AS4E                        2710
#define COG2ASD1_AS5E                 2711
#define G2AS5E                        2712
#define G2AS6E                        2713
#define COG2ASD1_AS6E                 2714
#define COG2ASD1_AS7E                 2715
#define G2AS7E                        2716
#define COG2STR                       2717
#define COG2STR_STRA                  2718
#define G2STRA                        2719
#define COG2STR_STRB                  2720
#define G2STRB                        2721
#define COG2STR_STRC                  2722
#define G2STRC                        2723
#define COG2STR_STRD                  2724
#define G2STRD                        2725
#define COG2STR_SDATA                 2726
#define G2SDATA                       2727
#define COG2STR_SDATB                 2728
#define G2SDATB                       2729
#define COG2STR_SDATC                 2730
#define G2SDATC                       2731
#define COG2STR_SDATD                 2732
#define G2SDATD                       2733
#define PRG1RTSS                      2734
#define RG1RTSS0                      2735
#define PRG1RTSS_RTSS                 2736
#define PRG1RTSS_RTSS0                2737
#define RG1RTSS1                      2738
#define PRG1RTSS_RTSS1                2739
#define RG1RTSS2                      2740
#define PRG1RTSS_RTSS2                2741
#define RG1RTSS3                      2742
#define PRG1RTSS_RTSS3                2743
#define PRG1FTSS                      2744
#define RG1FTSS0                      2745
#define PRG1FTSS_FTSS                 2746
#define PRG1FTSS_FTSS0                2747
#define RG1FTSS1                      2748
#define PRG1FTSS_FTSS1                2749
#define RG1FTSS2                      2750
#define PRG1FTSS_FTSS2                2751
#define RG1FTSS3                      2752
#define PRG1FTSS_FTSS3                2753
#define PRG1INS                       2754
#define PRG1INS_INS                   2755
#define PRG1INS_INS0                  2756
#define RG1INS0                       2757
#define PRG1INS_INS1                  2758
#define RG1INS1                       2759
#define PRG1INS_INS2                  2760
#define RG1INS2                       2761
#define PRG1INS_INS3                  2762
#define RG1INS3                       2763
#define PRG1CON0                      2764
