tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1778_tdd.h
#define PRG1CON0_GO                   2765
#define RG1GO                         2766
#define RG1OS                         2767
#define PRG1CON0_OS                   2768
#define RG1MODE0                      2769
#define RG1MODE                       2770
#define PRG1CON0_MODE                 2771
#define PRG1CON0_MODE0                2772
#define RG1MODE1                      2773
#define PRG1CON0_MODE1                2774
#define PRG1CON0_REDG                 2775
#define RG1REDG                       2776
#define RG1FEDG                       2777
#define PRG1CON0_FEDG                 2778
#define PRG1CON0_EN                   2779
#define RG1EN                         2780
#define PRG1CON1                      2781
#define PRG1CON1_RPOL                 2782
#define RG1RPOL                       2783
#define PRG1CON1_FPOL                 2784
#define RG1FPOL                       2785
#define PRG1CON1_RDY                  2786
#define RG1RDY                        2787
#define PRG1CON2                      2788
#define RG1ISET0                      2789
#define PRG1CON2_ISET                 2790
#define RG1ISET                       2791
#define PRG1CON2_ISET0                2792
#define RG1ISET1                      2793
#define PRG1CON2_ISET1                2794
#define RG1ISET2                      2795
#define PRG1CON2_ISET2                2796
#define RG1ISET3                      2797
#define PRG1CON2_ISET3                2798
#define RG1ISET4                      2799
#define PRG1CON2_ISET4                2800
#define PRG2RTSS                      2801
#define PRG2RTSS_RTSS                 2802
#define RG2RTSS0                      2803
#define PRG2RTSS_RTSS0                2804
#define RG2RTSS1                      2805
#define PRG2RTSS_RTSS1                2806
#define RG2RTSS2                      2807
#define PRG2RTSS_RTSS2                2808
#define RG2RTSS3                      2809
#define PRG2RTSS_RTSS3                2810
#define PRG2FTSS                      2811
#define RG2FTSS0                      2812
#define PRG2FTSS_FTSS                 2813
#define PRG2FTSS_FTSS0                2814
#define RG2FTSS1                      2815
#define PRG2FTSS_FTSS1                2816
#define PRG2FTSS_FTSS2                2817
#define RG2FTSS2                      2818
#define RG2FTSS3                      2819
#define PRG2FTSS_FTSS3                2820
#define PRG2INS                       2821
#define PRG2INS_INS                   2822
#define PRG2INS_INS0                  2823
#define RG2INS0                       2824
#define PRG2INS_INS1                  2825
#define RG2INS1                       2826
#define PRG2INS_INS2                  2827
#define RG2INS2                       2828
#define PRG2INS_INS3                  2829
#define RG2INS3                       2830
#define PRG2CON0                      2831
#define PRG2CON0_GO                   2832
#define RG2GO                         2833
#define PRG2CON0_OS                   2834
#define RG2OS                         2835
#define RG2MODE0                      2836
#define PRG2CON0_MODE0                2837
#define RG2MODE                       2838
#define PRG2CON0_MODE                 2839
#define RG2MODE1                      2840
#define PRG2CON0_MODE1                2841
#define PRG2CON0_REDG                 2842
#define RG2REDG                       2843
#define RG2FEDG                       2844
#define PRG2CON0_FEDG                 2845
#define PRG2CON0_EN                   2846
#define RG2EN                         2847
#define PRG2CON1                      2848
#define PRG2CON1_RPOL                 2849
#define RG2RPOL                       2850
#define PRG2CON1_FPOL                 2851
#define RG2FPOL                       2852
#define PRG2CON1_RDY                  2853
#define RG2RDY                        2854
#define PRG2CON2                      2855
#define PRG2CON2_ISET                 2856
#define RG2ISET0                      2857
#define PRG2CON2_ISET0                2858
#define RG2ISET                       2859
#define RG2ISET1                      2860
#define PRG2CON2_ISET1                2861
#define RG2ISET2                      2862
#define PRG2CON2_ISET2                2863
#define RG2ISET3                      2864
#define PRG2CON2_ISET3                2865
#define PRG2CON2_ISET4                2866
#define RG2ISET4                      2867
#define PRG3RTSS                      2868
#define PRG3RTSS_RTSS0                2869
#define PRG3RTSS_RTSS                 2870
#define RG3RTSS0                      2871
#define PRG3RTSS_RTSS1                2872
#define RG3RTSS1                      2873
#define PRG3RTSS_RTSS2                2874
#define RG3RTSS2                      2875
#define PRG3RTSS_RTSS3                2876
#define RG3RTSS3                      2877
#define PRG3FTSS                      2878
#define PRG3FTSS_FTSS0                2879
#define RG3FTSS0                      2880
#define PRG3FTSS_FTSS                 2881
#define RG3FTSS1                      2882
#define PRG3FTSS_FTSS1                2883
#define RG3FTSS2                      2884
#define PRG3FTSS_FTSS2                2885
#define RG3FTSS3                      2886
#define PRG3FTSS_FTSS3                2887
#define PRG3INS                       2888
#define RG3INS0                       2889
#define PRG3INS_INS0                  2890
#define PRG3INS_INS                   2891
#define RG3INS1                       2892
#define PRG3INS_INS1                  2893
#define PRG3INS_INS2                  2894
#define RG3INS2                       2895
#define RG3INS3                       2896
#define PRG3INS_INS3                  2897
#define PRG3CON0                      2898
#define PRG3CON0_GO                   2899
#define RG3GO                         2900
#define RG3OS                         2901
#define PRG3CON0_OS                   2902
#define PRG3CON0_MODE                 2903
#define RG3MODE                       2904
#define PRG3CON0_MODE0                2905
#define RG3MODE0                      2906
#define PRG3CON0_MODE1                2907
#define RG3MODE1                      2908
#define PRG3CON0_REDG                 2909
#define RG3REDG                       2910
#define PRG3CON0_FEDG                 2911
#define RG3FEDG                       2912
#define PRG3CON0_EN                   2913
#define RG3EN                         2914
#define PRG3CON1                      2915
#define PRG3CON1_RPOL                 2916
#define RG3RPOL                       2917
#define RG3FPOL                       2918
#define PRG3CON1_FPOL                 2919
#define PRG3CON1_RDY                  2920
#define RG3RDY                        2921
#define PRG3CON2                      2922
#define PRG3CON2_ISET                 2923
#define RG3ISET                       2924
#define RG3ISET0                      2925
#define PRG3CON2_ISET0                2926
#define PRG3CON2_ISET1                2927
#define RG3ISET1                      2928
#define RG3ISET2                      2929
#define PRG3CON2_ISET2                2930
#define RG3ISET3                      2931
#define PRG3CON2_ISET3                2932
#define PRG3CON2_ISET4                2933
#define RG3ISET4                      2934
#define COG3PHR                       2935
#define COG3PHR_PHR0                  2936
#define G3PHR0                        2937
#define COG3PHR_PHR                   2938
#define G3PHR1                        2939
#define COG3PHR_PHR1                  2940
#define COG3PHR_PHR2                  2941
#define G3PHR2                        2942
#define COG3PHR_PHR3                  2943
#define G3PHR3                        2944
#define COG3PHR_PHR4                  2945
#define G3PHR4                        2946
#define G3PHR5                        2947
#define COG3PHR_PHR5                  2948
#define COG3PHF                       2949
#define COG3PHF_PHF                   2950
#define G3PHF0                        2951
#define COG3PHF_PHF0                  2952
#define COG3PHF_PHF1                  2953
#define G3PHF1                        2954
#define COG3PHF_PHF2                  2955
#define G3PHF2                        2956
#define COG3PHF_PHF3                  2957
#define G3PHF3                        2958
#define COG3PHF_PHF4                  2959
#define G3PHF4                        2960
#define COG3PHF_PHF5                  2961
#define G3PHF5                        2962
#define COG3BLKR                      2963
#define COG3BLKR_BLKR0                2964
#define G3BLKR0                       2965
#define COG3BLKR_BLKR                 2966
#define COG3BLKR_BLKR1                2967
#define G3BLKR1                       2968
#define COG3BLKR_BLKR2                2969
#define G3BLKR2                       2970
#define COG3BLKR_BLKR3                2971
#define G3BLKR3                       2972
#define COG3BLKR_BLKR4                2973
#define G3BLKR4                       2974
#define COG3BLKR_BLKR5                2975
#define G3BLKR5                       2976
#define COG3BLKF                      2977
#define G3BLKF0                       2978
#define COG3BLKF_BLKF                 2979
#define COG3BLKF_BLKF0                2980
#define G3BLKF1                       2981
#define COG3BLKF_BLKF1                2982
#define G3BLKF2                       2983
#define COG3BLKF_BLKF2                2984
#define G3BLKF3                       2985
#define COG3BLKF_BLKF3                2986
#define G3BLKF4                       2987
#define COG3BLKF_BLKF4                2988
#define G3BLKF5                       2989
#define COG3BLKF_BLKF5                2990
#define COG3DBR                       2991
#define G3DBR0                        2992
#define COG3DBR_DBR0                  2993
#define COG3DBR_DBR                   2994
#define G3DBR1                        2995
#define COG3DBR_DBR1                  2996
#define G3DBR2                        2997
#define COG3DBR_DBR2                  2998
#define G3DBR3                        2999
#define COG3DBR_DBR3                  3000
#define G3DBR4                        3001
#define COG3DBR_DBR4                  3002
#define G3DBR5                        3003
#define COG3DBR_DBR5                  3004
#define COG3DBF                       3005
#define G3DBF                         3006
#define G3DBF0                        3007
#define COG3DBF_DBF0                  3008
#define G3DBF1                        3009
#define COG3DBF_DBF1                  3010
#define G3DBF2                        3011
#define COG3DBF_DBF2                  3012
#define G3DBF3                        3013
#define COG3DBF_DBF3                  3014
#define G3DBF4                        3015
#define COG3DBF_DBF4                  3016
#define G3DBF5                        3017
#define COG3DBF_DBF5                  3018
#define COG3CON0                      3019
#define G3MD                          3020
#define COG3CON0_MD                   3021
#define G3MD0                         3022
#define COG3CON0_MD0                  3023
#define G3MD1                         3024
#define COG3CON0_MD1                  3025
#define COG3CON0_MD2                  3026
#define G3MD2                         3027
#define G3CS                          3028
#define COG3CON0_CS0                  3029
#define G3CS0                         3030
#define COG3CON0_CS                   3031
#define COG3CON0_CS1                  3032
#define G3CS1                         3033
#define COG3CON0_LD                   3034
#define G3LD                          3035
#define G3EN                          3036
#define COG3CON0_EN                   3037
#define COG3CON1                      3038
#define G3POLA                        3039
#define COG3CON1_POLA                 3040
#define G3POLB                        3041
#define COG3CON1_POLB                 3042
#define G3POLC                        3043
#define COG3CON1_POLC                 3044
#define COG3CON1_POLD                 3045
#define G3POLD                        3046
#define G3FDBS                        3047
#define COG3CON1_FDBS                 3048
#define COG3CON1_RDBS                 3049
#define G3RDBS                        3050
#define COG3RIS0                      3051
#define G3RIS0                        3052
#define COG3RIS0_RIS0                 3053
#define G3RIS1                        3054
#define COG3RIS0_RIS1                 3055
#define G3RIS2                        3056
#define COG3RIS0_RIS2                 3057
#define G3RIS3                        3058
#define COG3RIS0_RIS3                 3059
#define G3RIS4                        3060
#define COG3RIS0_RIS4                 3061
#define G3RIS5                        3062
#define COG3RIS0_RIS5                 3063
#define G3RIS6                        3064
#define COG3RIS0_RIS6                 3065
#define G3RIS7                        3066
#define COG3RIS0_RIS7                 3067
#define COG3RIS1                      3068
#define G3RIS9                        3069
#define COG3RIS1_RIS9                 3070
#define G3RIS11                       3071
#define COG3RIS1_RIS11                3072
#define G3RIS12                       3073
#define COG3RIS1_RIS12                3074
#define G3RIS13                       3075
#define COG3RIS1_RIS13                3076
#define G3RIS14                       3077
#define COG3RIS1_RIS14                3078
#define G3RIS15                       3079
#define COG3RIS1_RIS15                3080
#define COG3RSIM0                     3081
#define G3RSIM0                       3082
#define COG3RSIM0_RSIM0               3083
#define G3RSIM1                       3084
#define COG3RSIM0_RSIM1               3085
#define G3RSIM2                       3086
#define COG3RSIM0_RSIM2               3087
#define G3RSIM3                       3088
#define COG3RSIM0_RSIM3               3089
#define G3RSIM4                       3090
#define COG3RSIM0_RSIM4               3091
#define G3RSIM5                       3092
#define COG3RSIM0_RSIM5               3093
#define G3RSIM6                       3094
#define COG3RSIM0_RSIM6               3095
#define G3RSIM7                       3096
#define COG3RSIM0_RSIM7               3097
#define COG3RSIM1                     3098
#define G3RSIM9                       3099
#define COG3RSIM1_RSIM9               3100
#define G3RSIM11                      3101
#define COG3RSIM1_RSIM11              3102
#define G3RSIM12                      3103
#define COG3RSIM1_RSIM12              3104
#define G3RSIM13                      3105
#define COG3RSIM1_RSIM13              3106
#define G3RSIM14                      3107
#define COG3RSIM1_RSIM14              3108
#define G3RSIM15                      3109
#define COG3RSIM1_RSIM15              3110
#define COG3FIS0                      3111
#define COG3FIS0_FIS0                 3112
#define G3FIS0                        3113
#define COG3FIS0_FIS1                 3114
#define G3FIS1                        3115
#define COG3FIS0_FIS2                 3116
#define G3FIS2                        3117
#define COG3FIS0_FIS3                 3118
#define G3FIS3                        3119
#define COG3FIS0_FIS4                 3120
#define G3FIS4                        3121
#define COG3FIS0_FIS5                 3122
#define G3FIS5                        3123
#define COG3FIS0_FIS6                 3124
#define G3FIS6                        3125
#define G3FIS7                        3126
#define COG3FIS0_FIS7                 3127
#define COG3FIS1                      3128
#define G3FIS9                        3129
#define COG3FIS1_FIS9                 3130
#define COG3FIS1_FIS11                3131
#define G3FIS11                       3132
#define G3FIS12                       3133
#define COG3FIS1_FIS12                3134
#define G3FIS13                       3135
#define COG3FIS1_FIS13                3136
#define G3FIS14                       3137
#define COG3FIS1_FIS14                3138
#define G3FIS15                       3139
#define COG3FIS1_FIS15                3140
#define COG3FSIM0                     3141
#define COG3FSIM0_FSIM0               3142
#define G3FSIM0                       3143
#define G3FSIM1                       3144
#define COG3FSIM0_FSIM1               3145
#define COG3FSIM0_FSIM2               3146
#define G3FSIM2                       3147
#define COG3FSIM0_FSIM3               3148
#define G3FSIM3                       3149
#define G3FSIM4                       3150
#define COG3FSIM0_FSIM4               3151
#define COG3FSIM0_FSIM5               3152
#define G3FSIM5                       3153
#define COG3FSIM0_FSIM6               3154
#define G3FSIM6                       3155
#define COG3FSIM0_FSIM7               3156
#define G3FSIM7                       3157
#define COG3FSIM1                     3158
#define COG3FSIM1_FSIM9               3159
#define G3FSIM9                       3160
#define COG3FSIM1_FSIM11              3161
#define G3FSIM11                      3162
#define G3FSIM12                      3163
#define COG3FSIM1_FSIM12              3164
#define COG3FSIM1_FSIM13              3165
#define G3FSIM13                      3166
#define G3FSIM14                      3167
#define COG3FSIM1_FSIM14              3168
#define G3FSIM15                      3169
#define COG3FSIM1_FSIM15              3170
#define COG3ASD0                      3171
#define COG3ASD0_ASDAC0               3172
#define G3ASDAC                       3173
#define G3ASDAC0                      3174
#define COG3ASD0_ASDAC                3175
#define COG3ASD0_ASDAC1               3176
#define G3ASDAC1                      3177
#define G3ASDBD                       3178
#define COG3ASD0_ASDBD                3179
#define G3ASDBD0                      3180
#define COG3ASD0_ASDBD0               3181
#define COG3ASD0_ASDBD1               3182
#define G3ASDBD1                      3183
#define COG3ASD0_ASREN                3184
#define COG3ASD0_ARSEN                3185
#define G3ASREN                       3186
#define G3ARSEN                       3187
#define COG3ASD0_ASE                  3188
#define G3ASE                         3189
#define COG3ASD1                      3190
#define G3AS0E                        3191
#define COG3ASD1_AS0E                 3192
#define G3AS1E                        3193
#define COG3ASD1_AS1E                 3194
#define COG3ASD1_AS2E                 3195
#define G3AS2E                        3196
#define G3AS3E                        3197
#define COG3ASD1_AS3E                 3198
#define G3AS4E                        3199
#define COG3ASD1_AS4E                 3200
#define G3AS5E                        3201
#define COG3ASD1_AS5E                 3202
#define G3AS6E                        3203
#define COG3ASD1_AS6E                 3204
#define COG3ASD1_AS7E                 3205
#define G3AS7E                        3206
#define COG3STR                       3207
#define COG3STR_STRA                  3208
#define G3STRA                        3209
#define COG3STR_STRB                  3210
#define G3STRB                        3211
#define COG3STR_STRC                  3212
#define G3STRC                        3213
#define COG3STR_STRD                  3214
#define G3STRD                        3215
#define COG3STR_SDATA                 3216
#define G3SDATA                       3217
#define COG3STR_SDATB                 3218
#define G3SDATB                       3219
#define COG3STR_SDATC                 3220
#define G3SDATC                       3221
#define COG3STR_SDATD                 3222
#define G3SDATD                       3223
#define CM4CON0                       3224
#define CM4CON0_SYNC                  3225
#define C4SYNC                        3226
#define C4HYS                         3227
#define CM4CON0_HYS                   3228
#define C4SP                          3229
#define C4ZLF                         3230
#define CM4CON0_ZLF                   3231
#define C4POL                         3232
#define CM4CON0_POL                   3233
#define C4OUT                         3234
#define CM4CON0_OUT                   3235
#define C4ON                          3236
#define CM4CON0_ON                    3237
#define CM4CON1                       3238
#define C4INTN                        3239
#define CM4CON1_INTN                  3240
#define CM4CON1_INTP                  3241
#define C4INTP                        3242
#define CM4NSEL                       3243
#define CM4NSEL_NCH                   3244
#define C4NCH0                        3245
#define C4NCH                         3246
#define C4NCH1                        3247
#define C4NCH2                        3248
#define C4NCH3                        3249
#define CM4PSEL                       3250
#define CM4PSEL_PCH0                  3251
#define C4PCH0                        3252
#define C4PCH                         3253
#define CM4PSEL_PCH                   3254
#define CM4PSEL_PCH1                  3255
#define C4PCH1                        3256
#define CM4PSEL_PCH2                  3257
#define C4PCH2                        3258
#define CM4PSEL_PCH3                  3259
#define C4PCH3                        3260
#define CM5CON0                       3261
#define CM5CON0_SYNC                  3262
#define C5SYNC                        3263
#define C5HYS                         3264
#define CM5CON0_HYS                   3265
#define C5SP                          3266
#define CM5CON0_ZLF                   3267
#define C5ZLF                         3268
#define C5POL                         3269
#define CM5CON0_POL                   3270
#define CM5CON0_OUT                   3271
#define C5OUT                         3272
#define CM5CON0_ON                    3273
#define C5ON                          3274
#define CM5CON1                       3275
#define CM5CON1_INTN                  3276
#define C5INTN                        3277
#define CM5CON1_INTP                  3278
#define C5INTP                        3279
#define CM5NSEL                       3280
#define C5NCH                         3281
#define CM5NSEL_NCH                   3282
#define C5NCH0                        3283
#define C5NCH1                        3284
#define C5NCH2                        3285
#define C5NCH3                        3286
#define CM5PSEL                       3287
#define C5PCH                         3288
#define CM5PSEL_PCH                   3289
#define C5PCH0                        3290
#define CM5PSEL_PCH0                  3291
#define C5PCH1                        3292
#define CM5PSEL_PCH1                  3293
#define C5PCH2                        3294
#define CM5PSEL_PCH2                  3295
#define C5PCH3                        3296
#define CM5PSEL_PCH3                  3297
#define CM6CON0                       3298
#define C6SYNC                        3299
#define CM6CON0_SYNC                  3300
#define C6HYS                         3301
#define CM6CON0_HYS                   3302
#define C6SP                          3303
#define CM6CON0_ZLF                   3304
#define C6ZLF                         3305
#define CM6CON0_POL                   3306
#define C6POL                         3307
#define C6OUT                         3308
#define CM6CON0_OUT                   3309
#define CM6CON0_ON                    3310
#define C6ON                          3311
#define CM6CON1                       3312
#define C6INTN                        3313
#define CM6CON1_INTN                  3314
#define CM6CON1_INTP                  3315
#define C6INTP                        3316
#define CM6NSEL                       3317
#define C6NCH                         3318
#define C6NCH0                        3319
#define CM6NSEL_NCH                   3320
#define C6NCH1                        3321
#define C6NCH2                        3322
