tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1778_tdd.h
#define C6NCH3                        3323
#define CM6PSEL                       3324
#define C6PCH                         3325
#define CM6PSEL_PCH0                  3326
#define CM6PSEL_PCH                   3327
#define C6PCH0                        3328
#define CM6PSEL_PCH1                  3329
#define C6PCH1                        3330
#define CM6PSEL_PCH2                  3331
#define C6PCH2                        3332
#define C6PCH3                        3333
#define CM6PSEL_PCH3                  3334
#define PWMEN                         3335
#define MPWM5EN                       3336
#define MPWM6EN                       3337
#define MPWM11EN                      3338
#define PWMLD                         3339
#define MPWM5LD                       3340
#define MPWM6LD                       3341
#define MPWM11LD                      3342
#define PWMOUT                        3343
#define MPWM5OUT                      3344
#define MPWM6OUT                      3345
#define MPWM11OUT                     3346
#define PWM5PHL0                      3347
#define PWM5PHL_PH                    3348
#define PWM5PHL                       3349
#define PWM5PHL1                      3350
#define PWM5PHL2                      3351
#define PWM5PHL3                      3352
#define PWM5PHL4                      3353
#define PWM5PHL5                      3354
#define PWM5PHL6                      3355
#define PWM5PHL7                      3356
#define PWM5PHH0                      3357
#define PWM5PHH_PH                    3358
#define PWM5PHH                       3359
#define PWM5PHH1                      3360
#define PWM5PHH2                      3361
#define PWM5PHH3                      3362
#define PWM5PHH4                      3363
#define PWM5PHH5                      3364
#define PWM5PHH6                      3365
#define PWM5PHH7                      3366
#define PWM5DCL_DC                    3367
#define PWM5DCL                       3368
#define PWM5DCL0                      3369
#define PWM5DCL1                      3370
#define PWM5DCL2                      3371
#define PWM5DCL3                      3372
#define PWM5DCL4                      3373
#define PWM5DCL5                      3374
#define PWM5DCL6                      3375
#define PWM5DCL7                      3376
#define PWM5DCH_DC                    3377
#define PWM5DCH                       3378
#define PWM5DCH0                      3379
#define PWM5DCH1                      3380
#define PWM5DCH2                      3381
#define PWM5DCH3                      3382
#define PWM5DCH4                      3383
#define PWM5DCH5                      3384
#define PWM5DCH6                      3385
#define PWM5DCH7                      3386
#define PWM5PRL0                      3387
#define PWM5PRL_PR                    3388
#define PWM5PRL                       3389
#define PWM5PRL1                      3390
#define PWM5PRL2                      3391
#define PWM5PRL3                      3392
#define PWM5PRL4                      3393
#define PWM5PRL5                      3394
#define PWM5PRL6                      3395
#define PWM5PRL7                      3396
#define PWM5PRH_PR                    3397
#define PWM5PRH0                      3398
#define PWM5PRH                       3399
#define PWM5PRH1                      3400
#define PWM5PRH2                      3401
#define PWM5PRH3                      3402
#define PWM5PRH4                      3403
#define PWM5PRH5                      3404
#define PWM5PRH6                      3405
#define PWM5PRH7                      3406
#define PWM5OFL                       3407
#define PWM5OFL0                      3408
#define PWM5OFL_OF                    3409
#define PWM5OFL1                      3410
#define PWM5OFL2                      3411
#define PWM5OFL3                      3412
#define PWM5OFL4                      3413
#define PWM5OFL5                      3414
#define PWM5OFL6                      3415
#define PWM5OFL7                      3416
#define PWM5OFH_OF                    3417
#define PWM5OFH                       3418
#define PWM5OFH0                      3419
#define PWM5OFH1                      3420
#define PWM5OFH2                      3421
#define PWM5OFH3                      3422
#define PWM5OFH4                      3423
#define PWM5OFH5                      3424
#define PWM5OFH6                      3425
#define PWM5OFH7                      3426
#define PWM5TMRL_TMR                  3427
#define PWM5TMRL                      3428
#define PWM5TMRL0                     3429
#define PWM5TMRL1                     3430
#define PWM5TMRL2                     3431
#define PWM5TMRL3                     3432
#define PWM5TMRL4                     3433
#define PWM5TMRL5                     3434
#define PWM5TMRL6                     3435
#define PWM5TMRL7                     3436
#define PWM5TMRH0                     3437
#define PWM5TMRH                      3438
#define PWM5TMRH_TMR                  3439
#define PWM5TMRH1                     3440
#define PWM5TMRH2                     3441
#define PWM5TMRH3                     3442
#define PWM5TMRH4                     3443
#define PWM5TMRH5                     3444
#define PWM5TMRH6                     3445
#define PWM5TMRH7                     3446
#define PWM5CON                       3447
#define PWM5MODE0                     3448
#define PWM5CON_MODE                  3449
#define PWM5MODE                      3450
#define PWM5CON_MODE0                 3451
#define PWM5MODE1                     3452
#define PWM5CON_MODE1                 3453
#define PWM5POL                       3454
#define PWM5CON_POL                   3455
#define PWM5OUT                       3456
#define PWM5CON_OUT                   3457
#define PWM5EN                        3458
#define PWM5CON_EN                    3459
#define PWM5INTE                      3460
#define PWM5INTE_PRIE                 3461
#define PWM5PRIE                      3462
#define PWM5INTE_DCIE                 3463
#define PWM5DCIE                      3464
#define PWM5INTE_PHIE                 3465
#define PWM5PHIE                      3466
#define PWM5OFIE                      3467
#define PWM5INTE_OFIE                 3468
#define PWM5INTF                      3469
#define PWM5INTF_PRIF                 3470
#define PWM5PRIF                      3471
#define PWM5INTF_DCIF                 3472
#define PWM5DCIF                      3473
#define PWM5INTF_PHIF                 3474
#define PWM5PHIF                      3475
#define PWM5OFIF                      3476
#define PWM5INTF_OFIF                 3477
#define PWM5CLKCON                    3478
#define PWM5CS0                       3479
#define PWM5CLKCON_CS0                3480
#define PWM5CS                        3481
#define PWM5CLKCON_CS                 3482
#define PWM5CS1                       3483
#define PWM5CLKCON_CS1                3484
#define PWM5CS2                       3485
#define PWM5CLKCON_CS2                3486
#define PWM5PS                        3487
#define PWM5CLKCON_PS0                3488
#define PWM5PS0                       3489
#define PWM5CLKCON_PS                 3490
#define PWM5CLKCON_PS1                3491
#define PWM5PS1                       3492
#define PWM5CLKCON_PS2                3493
#define PWM5PS2                       3494
#define PWM5LDCON                     3495
#define PWM5LDCON_LDS                 3496
#define PWM5LDCON_LDS0                3497
#define PWM5LDS                       3498
#define PWM5LDS0                      3499
#define PWM5LDCON_LDS1                3500
#define PWM5LDS1                      3501
#define PWM5LDCON_LDT                 3502
#define PWM5LDM                       3503
#define PWM5LDCON_LDA                 3504
#define PWM5LD                        3505
#define PWM5OFCON                     3506
#define PWM5OFCON_OFS0                3507
#define PWM5OFCON_OFS                 3508
#define PWM5OFS0                      3509
#define PWM5OFS                       3510
#define PWM5OFCON_OFS1                3511
#define PWM5OFS1                      3512
#define PWM5OFCON_OFO                 3513
#define PWM5OFMC                      3514
#define PWM5OFM                       3515
#define PWM5OFM0                      3516
#define PWM5OFCON_OFM                 3517
#define PWM5OFCON_OFM0                3518
#define PWM5OFM1                      3519
#define PWM5OFCON_OFM1                3520
#define PWM6PHL                       3521
#define PWM6PHL_PH                    3522
#define PWM6PHL0                      3523
#define PWM6PHL1                      3524
#define PWM6PHL2                      3525
#define PWM6PHL3                      3526
#define PWM6PHL4                      3527
#define PWM6PHL5                      3528
#define PWM6PHL6                      3529
#define PWM6PHL7                      3530
#define PWM6PHH0                      3531
#define PWM6PHH                       3532
#define PWM6PHH_PH                    3533
#define PWM6PHH1                      3534
#define PWM6PHH2                      3535
#define PWM6PHH3                      3536
#define PWM6PHH4                      3537
#define PWM6PHH5                      3538
#define PWM6PHH6                      3539
#define PWM6PHH7                      3540
#define PWM6DCL                       3541
#define PWM6DCL_DC                    3542
#define PWM6DCL0                      3543
#define PWM6DCL1                      3544
#define PWM6DCL2                      3545
#define PWM6DCL3                      3546
#define PWM6DCL4                      3547
#define PWM6DCL5                      3548
#define PWM6DCL6                      3549
#define PWM6DCL7                      3550
#define PWM6DCH                       3551
#define PWM6DCH0                      3552
#define PWM6DCH_DC                    3553
#define PWM6DCH1                      3554
#define PWM6DCH2                      3555
#define PWM6DCH3                      3556
#define PWM6DCH4                      3557
#define PWM6DCH5                      3558
#define PWM6DCH6                      3559
#define PWM6DCH7                      3560
#define PWM6PRL0                      3561
#define PWM6PRL                       3562
#define PWM6PRL_PR                    3563
#define PWM6PRL1                      3564
#define PWM6PRL2                      3565
#define PWM6PRL3                      3566
#define PWM6PRL4                      3567
#define PWM6PRL5                      3568
#define PWM6PRL6                      3569
#define PWM6PRL7                      3570
#define PWM6PRH_PR                    3571
#define PWM6PRH                       3572
#define PWM6PRH0                      3573
#define PWM6PRH1                      3574
#define PWM6PRH2                      3575
#define PWM6PRH3                      3576
#define PWM6PRH4                      3577
#define PWM6PRH5                      3578
#define PWM6PRH6                      3579
#define PWM6PRH7                      3580
#define PWM6OFL                       3581
#define PWM6OFL0                      3582
#define PWM6OFL_OF                    3583
#define PWM6OFL1                      3584
#define PWM6OFL2                      3585
#define PWM6OFL3                      3586
#define PWM6OFL4                      3587
#define PWM6OFL5                      3588
#define PWM6OFL6                      3589
#define PWM6OFL7                      3590
#define PWM6OFH                       3591
#define PWM6OFH_OF                    3592
#define PWM6OFH0                      3593
#define PWM6OFH1                      3594
#define PWM6OFH2                      3595
#define PWM6OFH3                      3596
#define PWM6OFH4                      3597
#define PWM6OFH5                      3598
#define PWM6OFH6                      3599
#define PWM6OFH7                      3600
#define PWM6TMRL_TMR                  3601
#define PWM6TMRL                      3602
#define PWM6TMRL0                     3603
#define PWM6TMRL1                     3604
#define PWM6TMRL2                     3605
#define PWM6TMRL3                     3606
#define PWM6TMRL4                     3607
#define PWM6TMRL5                     3608
#define PWM6TMRL6                     3609
#define PWM6TMRL7                     3610
#define PWM6TMRH_TMR                  3611
#define PWM6TMRH0                     3612
#define PWM6TMRH                      3613
#define PWM6TMRH1                     3614
#define PWM6TMRH2                     3615
#define PWM6TMRH3                     3616
#define PWM6TMRH4                     3617
#define PWM6TMRH5                     3618
#define PWM6TMRH6                     3619
#define PWM6TMRH7                     3620
#define PWM6CON                       3621
#define PWM6CON_MODE0                 3622
#define PWM6CON_MODE                  3623
#define PWM6MODE                      3624
#define PWM6MODE0                     3625
#define PWM6CON_MODE1                 3626
#define PWM6MODE1                     3627
#define PWM6POL                       3628
#define PWM6CON_POL                   3629
#define PWM6OUT                       3630
#define PWM6CON_OUT                   3631
#define PWM6EN                        3632
#define PWM6CON_EN                    3633
#define PWM6INTE                      3634
#define PWM6PRIE                      3635
#define PWM6INTE_PRIE                 3636
#define PWM6DCIE                      3637
#define PWM6INTE_DCIE                 3638
#define PWM6PHIE                      3639
#define PWM6INTE_PHIE                 3640
#define PWM6INTE_OFIE                 3641
#define PWM6OFIE                      3642
#define PWM6INTF                      3643
#define PWM6INTF_PRIF                 3644
#define PWM6PRIF                      3645
#define PWM6INTF_DCIF                 3646
#define PWM6DCIF                      3647
#define PWM6PHIF                      3648
#define PWM6INTF_PHIF                 3649
#define PWM6OFIF                      3650
#define PWM6INTF_OFIF                 3651
#define PWM6CLKCON                    3652
#define PWM6CLKCON_CS                 3653
#define PWM6CS                        3654
#define PWM6CLKCON_CS0                3655
#define PWM6CS0                       3656
#define PWM6CLKCON_CS1                3657
#define PWM6CS1                       3658
#define PWM6CLKCON_CS2                3659
#define PWM6CS2                       3660
#define PWM6PS                        3661
#define PWM6CLKCON_PS                 3662
#define PWM6PS0                       3663
#define PWM6CLKCON_PS0                3664
#define PWM6PS1                       3665
#define PWM6CLKCON_PS1                3666
#define PWM6CLKCON_PS2                3667
#define PWM6PS2                       3668
#define PWM6LDCON                     3669
#define PWM6LDS                       3670
#define PWM6LDCON_LDS                 3671
#define PWM6LDCON_LDS0                3672
#define PWM6LDS0                      3673
#define PWM6LDCON_LDS1                3674
#define PWM6LDS1                      3675
#define PWM6LDCON_LDT                 3676
#define PWM6LDM                       3677
#define PWM6LD                        3678
#define PWM6LDCON_LDA                 3679
#define PWM6OFCON                     3680
#define PWM6OFS0                      3681
#define PWM6OFCON_OFS                 3682
#define PWM6OFCON_OFS0                3683
#define PWM6OFS                       3684
#define PWM6OFS1                      3685
#define PWM6OFCON_OFS1                3686
#define PWM6OFCON_OFO                 3687
#define PWM6OFMC                      3688
#define PWM6OFM                       3689
#define PWM6OFCON_OFM                 3690
#define PWM6OFM0                      3691
#define PWM6OFCON_OFM0                3692
#define PWM6OFM1                      3693
#define PWM6OFCON_OFM1                3694
#define PWM11PHL_PH                   3695
#define PWM11PHL                      3696
#define PWM11PHL0                     3697
#define PWM11PHL1                     3698
#define PWM11PHL2                     3699
#define PWM11PHL3                     3700
#define PWM11PHL4                     3701
#define PWM11PHL5                     3702
#define PWM11PHL6                     3703
#define PWM11PHL7                     3704
#define PWM11PHH0                     3705
#define PWM11PHH                      3706
#define PWM11PHH_PH                   3707
#define PWM11PHH1                     3708
#define PWM11PHH2                     3709
#define PWM11PHH3                     3710
#define PWM11PHH4                     3711
#define PWM11PHH5                     3712
#define PWM11PHH6                     3713
#define PWM11PHH7                     3714
#define PWM11DCL_DC                   3715
#define PWM11DCL0                     3716
#define PWM11DCL                      3717
#define PWM11DCL1                     3718
#define PWM11DCL2                     3719
#define PWM11DCL3                     3720
#define PWM11DCL4                     3721
#define PWM11DCL5                     3722
#define PWM11DCL6                     3723
#define PWM11DCL7                     3724
#define PWM11DCH0                     3725
#define PWM11DCH_DC                   3726
#define PWM11DCH                      3727
#define PWM11DCH1                     3728
#define PWM11DCH2                     3729
#define PWM11DCH3                     3730
#define PWM11DCH4                     3731
#define PWM11DCH5                     3732
#define PWM11DCH6                     3733
#define PWM11DCH7                     3734
#define PWM11PRL0                     3735
#define PWM11PRL_PR                   3736
#define PWM11PRL                      3737
#define PWM11PRL1                     3738
#define PWM11PRL2                     3739
#define PWM11PRL3                     3740
#define PWM11PRL4                     3741
#define PWM11PRL5                     3742
#define PWM11PRL6                     3743
#define PWM11PRL7                     3744
#define PWM11PRH0                     3745
#define PWM11PRH_PR                   3746
#define PWM11PRH                      3747
#define PWM11PRH1                     3748
#define PWM11PRH2                     3749
#define PWM11PRH3                     3750
#define PWM11PRH4                     3751
#define PWM11PRH5                     3752
#define PWM11PRH6                     3753
#define PWM11PRH7                     3754
#define PWM11OFL_OF                   3755
#define PWM11OFL                      3756
#define PWM11OFL0                     3757
#define PWM11OFL1                     3758
#define PWM11OFL2                     3759
#define PWM11OFL3                     3760
#define PWM11OFL4                     3761
#define PWM11OFL5                     3762
#define PWM11OFL6                     3763
#define PWM11OFL7                     3764
#define PWM11OFH0                     3765
#define PWM11OFH                      3766
#define PWM11OFH_OF                   3767
#define PWM11OFH1                     3768
#define PWM11OFH2                     3769
#define PWM11OFH3                     3770
#define PWM11OFH4                     3771
#define PWM11OFH5                     3772
#define PWM11OFH6                     3773
#define PWM11OFH7                     3774
#define PWM11TMRL_TMR                 3775
#define PWM11TMRL0                    3776
#define PWM11TMRL                     3777
#define PWM11TMRL1                    3778
#define PWM11TMRL2                    3779
#define PWM11TMRL3                    3780
#define PWM11TMRL4                    3781
#define PWM11TMRL5                    3782
#define PWM11TMRL6                    3783
#define PWM11TMRL7                    3784
#define PWM11TMRH_TMR                 3785
#define PWM11TMRH                     3786
#define PWM11TMRH0                    3787
#define PWM11TMRH1                    3788
#define PWM11TMRH2                    3789
#define PWM11TMRH3                    3790
#define PWM11TMRH4                    3791
#define PWM11TMRH5                    3792
#define PWM11TMRH6                    3793
#define PWM11TMRH7                    3794
#define PWM11CON                      3795
#define PWM11MODE0                    3796
#define PWM11MODE                     3797
#define PWM11CON_MODE0                3798
#define PWM11CON_MODE                 3799
#define PWM11MODE1                    3800
#define PWM11CON_MODE1                3801
#define PWM11CON_POL                  3802
#define PWM11POL                      3803
#define PWM11CON_OUT                  3804
#define PWM11OUT                      3805
#define PWM11EN                       3806
#define PWM11CON_EN                   3807
#define PWM11INTE                     3808
#define PWM11INTE_PRIE                3809
#define PWM11PRIE                     3810
#define PWM11INTE_DCIE                3811
#define PWM11DCIE                     3812
#define PWM11INTE_PHIE                3813
#define PWM11PHIE                     3814
#define PWM11INTE_OFIE                3815
#define PWM11OFIE                     3816
#define PWM11INTF                     3817
#define PWM11INTF_PRIF                3818
#define PWM11PRIF                     3819
#define PWM11INTF_DCIF                3820
#define PWM11DCIF                     3821
#define PWM11PHIF                     3822
#define PWM11INTF_PHIF                3823
#define PWM11INTF_OFIF                3824
#define PWM11OFIF                     3825
#define PWM11CLKCON                   3826
#define PWM11CS0                      3827
#define PWM11CLKCON_CS0               3828
#define PWM11CS                       3829
#define PWM11CLKCON_CS                3830
#define PWM11CS1                      3831
#define PWM11CLKCON_CS1               3832
#define PWM11CLKCON_CS2               3833
#define PWM11CS2                      3834
#define PWM11PS0                      3835
#define PWM11PS                       3836
#define PWM11CLKCON_PS                3837
#define PWM11CLKCON_PS0               3838
#define PWM11PS1                      3839
#define PWM11CLKCON_PS1               3840
#define PWM11PS2                      3841
#define PWM11CLKCON_PS2               3842
#define PWM11LDCON                    3843
#define PWM11LDS0                     3844
#define PWM11LDCON_LDS                3845
#define PWM11LDCON_LDS0               3846
#define PWM11LDS                      3847
#define PWM11LDS1                     3848
#define PWM11LDCON_LDS1               3849
#define PWM11LDM                      3850
#define PWM11LDCON_LDT                3851
#define PWM11LD                       3852
#define PWM11LDCON_LDA                3853
#define PWM11OFCON                    3854
#define PWM11OFS0                     3855
#define PWM11OFCON_OFS0               3856
#define PWM11OFS                      3857
#define PWM11OFCON_OFS                3858
#define PWM11OFCON_OFS1               3859
#define PWM11OFS1                     3860
#define PWM11OFCON_OFO                3861
#define PWM11OFMC                     3862
#define PWM11OFCON_OFM0               3863
#define PWM11OFCON_OFM                3864
#define PWM11OFM                      3865
#define PWM11OFM0                     3866
#define PWM11OFCON_OFM1               3867
#define PWM11OFM1                     3868
#define PPSLOCK                       3869
#define PPSLOCKED                     3870
#define INTPPS                        3871
#define T0CKIPPS                      3872
#define T1CKIPPS                      3873
#define T1GPPS                        3874
#define T3CKIPPS                      3875
#define T3GPPS                        3876
#define T5CKIPPS                      3877
#define T5GPPS                        3878
#define T2INPPS                       3879
#define T4INPPS                       3880
