tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1778_tdd.h
#define T6INPPS                       3881
#define T8INPPS                       3882
#define CCP1PPS                       3883
#define CCP2PPS                       3884
#define CCP7PPS                       3885
#define COG1INPPS                     3886
#define COG2INPPS                     3887
#define COG3INPPS                     3888
#define MD1CLPPS                      3889
#define MD1CHPPS                      3890
#define MD1MODPPS                     3891
#define MD2CLPPS                      3892
#define MD2CHPPS                      3893
#define MD2MODPPS                     3894
#define MD3CLPPS                      3895
#define MD3CHPPS                      3896
#define MD3MODPPS                     3897
#define PRG1RPPS                      3898
#define PRG1FPPS                      3899
#define PRG2RPPS                      3900
#define PRG2FPPS                      3901
#define PRG3RPPS                      3902
#define PRG3FPPS                      3903
#define CLCIN0PPS                     3904
#define CLCIN1PPS                     3905
#define CLCIN2PPS                     3906
#define CLCIN3PPS                     3907
#define ADCACTPPS                     3908
#define SSPCLKPPS                     3909
#define SSPDATPPS                     3910
#define SSPSSPPS                      3911
#define RXPPS                         3912
#define CKPPS                         3913
#define RA0PPS                        3914
#define RA1PPS                        3915
#define RA2PPS                        3916
#define RA3PPS                        3917
#define RA4PPS                        3918
#define RA5PPS                        3919
#define RA6PPS                        3920
#define RA7PPS                        3921
#define RB0PPS                        3922
#define RB1PPS                        3923
#define RB2PPS                        3924
#define RB3PPS                        3925
#define RB4PPS                        3926
#define RB5PPS                        3927
#define RB6PPS                        3928
#define RB7PPS                        3929
#define RC0PPS                        3930
#define RC1PPS                        3931
#define RC2PPS                        3932
#define RC3PPS                        3933
#define RC4PPS                        3934
#define RC5PPS                        3935
#define RC6PPS                        3936
#define RC7PPS                        3937
#define CLCDATA                       3938
#define MCLC1OUT                      3939
#define MCLC2OUT                      3940
#define MCLC3OUT                      3941
#define MLC4OUT                       3942
#define CLC1CON                       3943
#define CLC1CON_MODE                  3944
#define LC1MODE0                      3945
#define LC1MODE                       3946
#define CLC1CON_MODE0                 3947
#define LC1MODE1                      3948
#define CLC1CON_MODE1                 3949
#define CLC1CON_MODE2                 3950
#define LC1MODE2                      3951
#define LC1INTN                       3952
#define CLC1CON_INTN                  3953
#define LC1INTP                       3954
#define CLC1CON_INTP                  3955
#define CLC1CON_OUT                   3956
#define LC1OUT                        3957
#define LC1EN                         3958
#define CLC1CON_EN                    3959
#define CLC1POL                       3960
#define LC1G1POL                      3961
#define CLC1POL_G1POL                 3962
#define CLC1POL_G2POL                 3963
#define LC1G2POL                      3964
#define LC1G3POL                      3965
#define CLC1POL_G3POL                 3966
#define LC1G4POL                      3967
#define CLC1POL_G4POL                 3968
#define CLC1POL_POL                   3969
#define LC1POL                        3970
#define CLC1SEL0                      3971
#define CLC1SEL0_D1S0                 3972
#define LC1D1S0                       3973
#define CLC1SEL0_D1S                  3974
#define LC1D1S                        3975
#define CLC1SEL0_D1S1                 3976
#define LC1D1S1                       3977
#define CLC1SEL0_D1S2                 3978
#define LC1D1S2                       3979
#define LC1D1S3                       3980
#define CLC1SEL0_D1S3                 3981
#define CLC1SEL0_D1S4                 3982
#define LC1D1S4                       3983
#define CLC1SEL0_D1S5                 3984
#define LC1D1S5                       3985
#define CLC1SEL1                      3986
#define CLC1SEL1_D2S0                 3987
#define CLC1SEL1_D2S                  3988
#define LC1D2S                        3989
#define LC1D2S0                       3990
#define CLC1SEL1_D2S1                 3991
#define LC1D2S1                       3992
#define CLC1SEL1_D2S2                 3993
#define LC1D2S2                       3994
#define LC1D2S3                       3995
#define CLC1SEL1_D2S3                 3996
#define LC1D2S4                       3997
#define CLC1SEL1_D2S4                 3998
#define LC1D2S5                       3999
#define CLC1SEL1_D2S5                 4000
#define CLC1SEL2                      4001
#define LC1D3S0                       4002
#define CLC1SEL2_D3S                  4003
#define LC1D3S                        4004
#define CLC1SEL2_D3S0                 4005
#define LC1D3S1                       4006
#define CLC1SEL2_D3S1                 4007
#define LC1D3S2                       4008
#define CLC1SEL2_D3S2                 4009
#define LC1D3S3                       4010
#define CLC1SEL2_D3S3                 4011
#define LC1D3S4                       4012
#define CLC1SEL2_D3S4                 4013
#define LC1D3S5                       4014
#define CLC1SEL2_D3S5                 4015
#define CLC1SEL3                      4016
#define CLC1SEL3_D4S                  4017
#define LC1D4S                        4018
#define LC1D4S0                       4019
#define CLC1SEL3_D4S0                 4020
#define CLC1SEL3_D4S1                 4021
#define LC1D4S1                       4022
#define LC1D4S2                       4023
#define CLC1SEL3_D4S2                 4024
#define LC1D4S3                       4025
#define CLC1SEL3_D4S3                 4026
#define LC1D4S4                       4027
#define CLC1SEL3_D4S4                 4028
#define LC1D4S5                       4029
#define CLC1SEL3_D4S5                 4030
#define CLC1GLS0                      4031
#define CLC1GLS0_D1N                  4032
#define LC1G1D1N                      4033
#define CLC1GLS0_D1T                  4034
#define LC1G1D1T                      4035
#define LC1G1D2N                      4036
#define CLC1GLS0_D2N                  4037
#define LC1G1D2T                      4038
#define CLC1GLS0_D2T                  4039
#define CLC1GLS0_D3N                  4040
#define LC1G1D3N                      4041
#define CLC1GLS0_D3T                  4042
#define LC1G1D3T                      4043
#define CLC1GLS0_D4N                  4044
#define LC1G1D4N                      4045
#define CLC1GLS0_D4T                  4046
#define LC1G1D4T                      4047
#define CLC1GLS1                      4048
#define CLC1GLS1_D1N                  4049
#define LC1G2D1N                      4050
#define LC1G2D1T                      4051
#define CLC1GLS1_D1T                  4052
#define CLC1GLS1_D2N                  4053
#define LC1G2D2N                      4054
#define LC1G2D2T                      4055
#define CLC1GLS1_D2T                  4056
#define CLC1GLS1_D3N                  4057
#define LC1G2D3N                      4058
#define LC1G2D3T                      4059
#define CLC1GLS1_D3T                  4060
#define CLC1GLS1_D4N                  4061
#define LC1G2D4N                      4062
#define LC1G2D4T                      4063
#define CLC1GLS1_D4T                  4064
#define CLC1GLS2                      4065
#define CLC1GLS2_D1N                  4066
#define LC1G3D1N                      4067
#define LC1G3D1T                      4068
#define CLC1GLS2_D1T                  4069
#define LC1G3D2N                      4070
#define CLC1GLS2_D2N                  4071
#define LC1G3D2T                      4072
#define CLC1GLS2_D2T                  4073
#define CLC1GLS2_D3N                  4074
#define LC1G3D3N                      4075
#define LC1G3D3T                      4076
#define CLC1GLS2_D3T                  4077
#define LC1G3D4N                      4078
#define CLC1GLS2_D4N                  4079
#define LC1G3D4T                      4080
#define CLC1GLS2_D4T                  4081
#define CLC1GLS3                      4082
#define LC1G4D1N                      4083
#define CLC1GLS3_G4D1N                4084
#define LC1G4D1T                      4085
#define CLC1GLS3_G4D1T                4086
#define CLC1GLS3_G4D2N                4087
#define LC1G4D2N                      4088
#define CLC1GLS3_G4D2T                4089
#define LC1G4D2T                      4090
#define LC1G4D3N                      4091
#define CLC1GLS3_G4D3N                4092
#define LC1G4D3T                      4093
#define CLC1GLS3_G4D3T                4094
#define CLC1GLS3_G4D4N                4095
#define LC1G4D4N                      4096
#define CLC1GLS3_G4D4T                4097
#define LC1G4D4T                      4098
#define CLC2CON                       4099
#define LC2MODE0                      4100
#define CLC2CON_MODE                  4101
#define LC2MODE                       4102
#define CLC2CON_MODE0                 4103
#define LC2MODE1                      4104
#define CLC2CON_MODE1                 4105
#define LC2MODE2                      4106
#define CLC2CON_MODE2                 4107
#define LC2INTN                       4108
#define CLC2CON_INTN                  4109
#define LC2INTP                       4110
#define CLC2CON_INTP                  4111
#define CLC2CON_OUT                   4112
#define LC2OUT                        4113
#define CLC2CON_EN                    4114
#define LC2EN                         4115
#define CLC2POL                       4116
#define LC2G1POL                      4117
#define CLC2POL_G1POL                 4118
#define LC2G2POL                      4119
#define CLC2POL_G2POL                 4120
#define LC2G3POL                      4121
#define CLC2POL_G3POL                 4122
#define LC2G4POL                      4123
#define CLC2POL_G4POL                 4124
#define CLC2POL_POL                   4125
#define LC2POL                        4126
#define CLC2SEL0                      4127
#define CLC2SEL0_D1S                  4128
#define LC2D1S0                       4129
#define CLC2SEL0_D1S0                 4130
#define LC2D1S                        4131
#define LC2D1S1                       4132
#define CLC2SEL0_D1S1                 4133
#define LC2D1S2                       4134
#define CLC2SEL0_D1S2                 4135
#define CLC2SEL0_D1S3                 4136
#define LC2D1S3                       4137
#define LC2D1S4                       4138
#define CLC2SEL0_D1S4                 4139
#define LC2D1S5                       4140
#define CLC2SEL0_D1S5                 4141
#define CLC2SEL1                      4142
#define LC2D2S0                       4143
#define CLC2SEL1_D2S0                 4144
#define LC2D2S                        4145
#define CLC2SEL1_D2S                  4146
#define LC2D2S1                       4147
#define CLC2SEL1_D2S1                 4148
#define LC2D2S2                       4149
#define CLC2SEL1_D2S2                 4150
#define LC2D2S3                       4151
#define CLC2SEL1_D2S3                 4152
#define LC2D2S4                       4153
#define CLC2SEL1_D2S4                 4154
#define LC2D2S5                       4155
#define CLC2SEL1_D2S5                 4156
#define CLC2SEL2                      4157
#define CLC2SEL2_D3S                  4158
#define LC2D3S0                       4159
#define CLC2SEL2_D3S0                 4160
#define LC2D3S                        4161
#define CLC2SEL2_D3S1                 4162
#define LC2D3S1                       4163
#define LC2D3S2                       4164
#define CLC2SEL2_D3S2                 4165
#define LC2D3S3                       4166
#define CLC2SEL2_D3S3                 4167
#define LC2D3S4                       4168
#define CLC2SEL2_D3S4                 4169
#define LC2D3S5                       4170
#define CLC2SEL2_D3S5                 4171
#define CLC2SEL3                      4172
#define LC2D4S0                       4173
#define CLC2SEL3_D4S                  4174
#define CLC2SEL3_D4S0                 4175
#define LC2D4S                        4176
#define LC2D4S1                       4177
#define CLC2SEL3_D4S1                 4178
#define LC2D4S2                       4179
#define CLC2SEL3_D4S2                 4180
#define CLC2SEL3_D4S3                 4181
#define LC2D4S3                       4182
#define LC2D4S4                       4183
#define CLC2SEL3_D4S4                 4184
#define LC2D4S5                       4185
#define CLC2SEL3_D4S5                 4186
#define CLC2GLS0                      4187
#define LC2G1D1N                      4188
#define CLC2GLS0_D1N                  4189
#define CLC2GLS0_D1T                  4190
#define LC2G1D1T                      4191
#define LC2G1D2N                      4192
#define CLC2GLS0_D2N                  4193
#define CLC2GLS0_D2T                  4194
#define LC2G1D2T                      4195
#define LC2G1D3N                      4196
#define CLC2GLS0_D3N                  4197
#define CLC2GLS0_D3T                  4198
#define LC2G1D3T                      4199
#define LC2G1D4N                      4200
#define CLC2GLS0_D4N                  4201
#define CLC2GLS0_D4T                  4202
#define LC2G1D4T                      4203
#define CLC2GLS1                      4204
#define CLC2GLS1_D1N                  4205
#define LC2G2D1N                      4206
#define CLC2GLS1_D1T                  4207
#define LC2G2D1T                      4208
#define CLC2GLS1_D2N                  4209
#define LC2G2D2N                      4210
#define CLC2GLS1_D2T                  4211
#define LC2G2D2T                      4212
#define LC2G2D3N                      4213
#define CLC2GLS1_D3N                  4214
#define LC2G2D3T                      4215
#define CLC2GLS1_D3T                  4216
#define LC2G2D4N                      4217
#define CLC2GLS1_D4N                  4218
#define LC2G2D4T                      4219
#define CLC2GLS1_D4T                  4220
#define CLC2GLS2                      4221
#define LC2G3D1N                      4222
#define CLC2GLS2_D1N                  4223
#define CLC2GLS2_D1T                  4224
#define LC2G3D1T                      4225
#define CLC2GLS2_D2N                  4226
#define LC2G3D2N                      4227
#define LC2G3D2T                      4228
#define CLC2GLS2_D2T                  4229
#define CLC2GLS2_D3N                  4230
#define LC2G3D3N                      4231
#define CLC2GLS2_D3T                  4232
#define LC2G3D3T                      4233
#define CLC2GLS2_D4N                  4234
#define LC2G3D4N                      4235
#define LC2G3D4T                      4236
#define CLC2GLS2_D4T                  4237
#define CLC2GLS3                      4238
#define LC2G4D1N                      4239
#define CLC2GLS3_G4D1N                4240
#define CLC2GLS3_G4D1T                4241
#define LC2G4D1T                      4242
#define CLC2GLS3_G4D2N                4243
#define LC2G4D2N                      4244
#define LC2G4D2T                      4245
#define CLC2GLS3_G4D2T                4246
#define CLC2GLS3_G4D3N                4247
#define LC2G4D3N                      4248
#define CLC2GLS3_G4D3T                4249
#define LC2G4D3T                      4250
#define LC2G4D4N                      4251
#define CLC2GLS3_G4D4N                4252
#define CLC2GLS3_G4D4T                4253
#define LC2G4D4T                      4254
#define CLC3CON                       4255
#define LC3MODE0                      4256
#define CLC3CON_MODE0                 4257
#define CLC3CON_MODE                  4258
#define LC3MODE                       4259
#define LC3MODE1                      4260
#define CLC3CON_MODE1                 4261
#define LC3MODE2                      4262
#define CLC3CON_MODE2                 4263
#define LC3INTN                       4264
#define CLC3CON_INTN                  4265
#define CLC3CON_INTP                  4266
#define LC3INTP                       4267
#define CLC3CON_OUT                   4268
#define LC3OUT                        4269
#define LC3EN                         4270
#define CLC3CON_EN                    4271
#define CLC3POL                       4272
#define LC3G1POL                      4273
#define CLC3POL_G1POL                 4274
#define LC3G2POL                      4275
#define CLC3POL_G2POL                 4276
#define CLC3POL_G3POL                 4277
#define LC3G3POL                      4278
#define LC3G4POL                      4279
#define CLC3POL_G4POL                 4280
#define LC3POL                        4281
#define CLC3POL_POL                   4282
#define CLC3SEL0                      4283
#define CLC3SEL0_D1S0                 4284
#define LC3D1S0                       4285
#define CLC3SEL0_D1S                  4286
#define LC3D1S                        4287
#define LC3D1S1                       4288
#define CLC3SEL0_D1S1                 4289
#define LC3D1S2                       4290
#define CLC3SEL0_D1S2                 4291
#define LC3D1S3                       4292
#define CLC3SEL0_D1S3                 4293
#define LC3D1S4                       4294
#define CLC3SEL0_D1S4                 4295
#define LC3D1S5                       4296
#define CLC3SEL0_D1S5                 4297
#define CLC3SEL1                      4298
#define CLC3SEL1_D2S                  4299
#define CLC3SEL1_D2S0                 4300
#define LC3D2S                        4301
#define LC3D2S0                       4302
#define CLC3SEL1_D2S1                 4303
#define LC3D2S1                       4304
#define CLC3SEL1_D2S2                 4305
#define LC3D2S2                       4306
#define CLC3SEL1_D2S3                 4307
#define LC3D2S3                       4308
#define CLC3SEL1_D2S4                 4309
#define LC3D2S4                       4310
#define CLC3SEL1_D2S5                 4311
#define LC3D2S5                       4312
#define CLC3SEL2                      4313
#define LC3D3S                        4314
#define CLC3SEL2_D3S                  4315
#define LC3D3S0                       4316
#define CLC3SEL2_D3S0                 4317
#define LC3D3S1                       4318
#define CLC3SEL2_D3S1                 4319
#define LC3D3S2                       4320
#define CLC3SEL2_D3S2                 4321
#define LC3D3S3                       4322
#define CLC3SEL2_D3S3                 4323
#define CLC3SEL2_D3S4                 4324
#define LC3D3S4                       4325
#define CLC3SEL2_D3S5                 4326
#define LC3D3S5                       4327
#define CLC3SEL3                      4328
#define CLC3SEL3_D4S0                 4329
#define LC3D4S0                       4330
#define CLC3SEL3_D4S                  4331
#define LC3D4S                        4332
#define LC3D4S1                       4333
#define CLC3SEL3_D4S1                 4334
#define LC3D4S2                       4335
#define CLC3SEL3_D4S2                 4336
#define LC3D4S3                       4337
#define CLC3SEL3_D4S3                 4338
#define LC3D4S4                       4339
#define CLC3SEL3_D4S4                 4340
#define LC3D4S5                       4341
#define CLC3SEL3_D4S5                 4342
#define CLC3GLS0                      4343
#define CLC3GLS0_D1N                  4344
#define LC3G1D1N                      4345
#define LC3G1D1T                      4346
#define CLC3GLS0_D1T                  4347
#define LC3G1D2N                      4348
#define CLC3GLS0_D2N                  4349
#define CLC3GLS0_D2T                  4350
#define LC3G1D2T                      4351
#define CLC3GLS0_D3N                  4352
#define LC3G1D3N                      4353
#define LC3G1D3T                      4354
#define CLC3GLS0_D3T                  4355
#define CLC3GLS0_D4N                  4356
#define LC3G1D4N                      4357
#define CLC3GLS0_D4T                  4358
#define LC3G1D4T                      4359
#define CLC3GLS1                      4360
#define LC3G2D1N                      4361
#define CLC3GLS1_D1N                  4362
#define CLC3GLS1_D1T                  4363
#define LC3G2D1T                      4364
#define LC3G2D2N                      4365
#define CLC3GLS1_D2N                  4366
#define LC3G2D2T                      4367
#define CLC3GLS1_D2T                  4368
#define LC3G2D3N                      4369
#define CLC3GLS1_D3N                  4370
#define CLC3GLS1_D3T                  4371
#define LC3G2D3T                      4372
#define LC3G2D4N                      4373
#define CLC3GLS1_D4N                  4374
#define LC3G2D4T                      4375
#define CLC3GLS1_D4T                  4376
#define CLC3GLS2                      4377
#define LC3G3D1N                      4378
#define CLC3GLS2_D1N                  4379
#define LC3G3D1T                      4380
#define CLC3GLS2_D1T                  4381
#define CLC3GLS2_D2N                  4382
#define LC3G3D2N                      4383
#define CLC3GLS2_D2T                  4384
#define LC3G3D2T                      4385
#define CLC3GLS2_D3N                  4386
#define LC3G3D3N                      4387
#define LC3G3D3T                      4388
#define CLC3GLS2_D3T                  4389
#define CLC3GLS2_D4N                  4390
#define LC3G3D4N                      4391
#define CLC3GLS2_D4T                  4392
#define LC3G3D4T                      4393
#define CLC3GLS3                      4394
#define LC3G4D1N                      4395
#define CLC3GLS3_G4D1N                4396
#define LC3G4D1T                      4397
#define CLC3GLS3_G4D1T                4398
#define LC3G4D2N                      4399
#define CLC3GLS3_G4D2N                4400
#define CLC3GLS3_G4D2T                4401
#define LC3G4D2T                      4402
#define LC3G4D3N                      4403
#define CLC3GLS3_G4D3N                4404
#define CLC3GLS3_G4D3T                4405
#define LC3G4D3T                      4406
#define LC3G4D4N                      4407
#define CLC3GLS3_G4D4N                4408
#define LC3G4D4T                      4409
#define CLC3GLS3_G4D4T                4410
#define CLC4CON                       4411
#define LC4MODE                       4412
#define CLC4CON_MODE                  4413
#define LC4MODE0                      4414
#define CLC4CON_MODE0                 4415
#define LC4MODE1                      4416
#define CLC4CON_MODE1                 4417
#define LC4MODE2                      4418
#define CLC4CON_MODE2                 4419
#define LC4INTN                       4420
#define CLC4CON_INTN                  4421
#define CLC4CON_INTP                  4422
#define LC4INTP                       4423
#define CLC4CON_OUT                   4424
#define LC4OUT                        4425
#define CLC4CON_EN                    4426
#define LC4EN                         4427
#define CLC4POL                       4428
#define CLC4POL_G1POL                 4429
#define LC4G1POL                      4430
#define CLC4POL_G2POL                 4431
#define LC4G2POL                      4432
#define CLC4POL_G3POL                 4433
#define LC4G3POL                      4434
#define LC4G4POL                      4435
#define CLC4POL_G4POL                 4436
#define LC4POL                        4437
#define CLC4POL_POL                   4438
