tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1778_tdd.h
#define CLC4SEL0                      4439
#define CLC4SEL0_D1S0                 4440
#define LC4D1S0                       4441
#define CLC4SEL0_D1S                  4442
#define LC4D1S                        4443
#define CLC4SEL0_D1S1                 4444
#define LC4D1S1                       4445
#define CLC4SEL0_D1S2                 4446
#define LC4D1S2                       4447
#define CLC4SEL0_D1S3                 4448
#define LC4D1S3                       4449
#define CLC4SEL0_D1S4                 4450
#define LC4D1S4                       4451
#define CLC4SEL0_D1S5                 4452
#define LC4D1S5                       4453
#define CLC4SEL1                      4454
#define LC4D2S0                       4455
#define CLC4SEL1_D2S                  4456
#define CLC4SEL1_D2S0                 4457
#define LC4D2S                        4458
#define CLC4SEL1_D2S1                 4459
#define LC4D2S1                       4460
#define LC4D2S2                       4461
#define CLC4SEL1_D2S2                 4462
#define LC4D2S3                       4463
#define CLC4SEL1_D2S3                 4464
#define LC4D2S4                       4465
#define CLC4SEL1_D2S4                 4466
#define LC4D2S5                       4467
#define CLC4SEL1_D2S5                 4468
#define CLC4SEL2                      4469
#define LC4D3S                        4470
#define CLC4SEL2_D3S                  4471
#define CLC4SEL2_D3S0                 4472
#define LC4D3S0                       4473
#define LC4D3S1                       4474
#define CLC4SEL2_D3S1                 4475
#define CLC4SEL2_D3S2                 4476
#define LC4D3S2                       4477
#define CLC4SEL2_D3S3                 4478
#define LC4D3S3                       4479
#define CLC4SEL2_D3S4                 4480
#define LC4D3S4                       4481
#define CLC4SEL2_D3S5                 4482
#define LC4D3S5                       4483
#define CLC4SEL3                      4484
#define LC4D4S0                       4485
#define LC4D4S                        4486
#define CLC4SEL3_D4S0                 4487
#define CLC4SEL3_D4S                  4488
#define LC4D4S1                       4489
#define CLC4SEL3_D4S1                 4490
#define LC4D4S2                       4491
#define CLC4SEL3_D4S2                 4492
#define LC4D4S3                       4493
#define CLC4SEL3_D4S3                 4494
#define LC4D4S4                       4495
#define CLC4SEL3_D4S4                 4496
#define LC4D4S5                       4497
#define CLC4SEL3_D4S5                 4498
#define CLC4GLS0                      4499
#define CLC4GLS0_D1N                  4500
#define LC4G1D1N                      4501
#define CLC4GLS0_D1T                  4502
#define LC4G1D1T                      4503
#define CLC4GLS0_D2N                  4504
#define LC4G1D2N                      4505
#define CLC4GLS0_D2T                  4506
#define LC4G1D2T                      4507
#define CLC4GLS0_D3N                  4508
#define LC4G1D3N                      4509
#define CLC4GLS0_D3T                  4510
#define LC4G1D3T                      4511
#define CLC4GLS0_D4N                  4512
#define LC4G1D4N                      4513
#define CLC4GLS0_D4T                  4514
#define LC4G1D4T                      4515
#define CLC4GLS1                      4516
#define CLC4GLS1_D1N                  4517
#define LC4G2D1N                      4518
#define CLC4GLS1_D1T                  4519
#define LC4G2D1T                      4520
#define LC4G2D2N                      4521
#define CLC4GLS1_D2N                  4522
#define LC4G2D2T                      4523
#define CLC4GLS1_D2T                  4524
#define CLC4GLS1_D3N                  4525
#define LC4G2D3N                      4526
#define LC4G2D3T                      4527
#define CLC4GLS1_D3T                  4528
#define CLC4GLS1_D4N                  4529
#define LC4G2D4N                      4530
#define CLC4GLS1_D4T                  4531
#define LC4G2D4T                      4532
#define CLC4GLS2                      4533
#define CLC4GLS2_D1N                  4534
#define LC4G3D1N                      4535
#define CLC4GLS2_D1T                  4536
#define LC4G3D1T                      4537
#define LC4G3D2N                      4538
#define CLC4GLS2_D2N                  4539
#define LC4G3D2T                      4540
#define CLC4GLS2_D2T                  4541
#define CLC4GLS2_D3N                  4542
#define LC4G3D3N                      4543
#define CLC4GLS2_D3T                  4544
#define LC4G3D3T                      4545
#define LC4G3D4N                      4546
#define CLC4GLS2_D4N                  4547
#define LC4G3D4T                      4548
#define CLC4GLS2_D4T                  4549
#define CLC4GLS3                      4550
#define CLC4GLS3_G4D1N                4551
#define LC4G4D1N                      4552
#define LC4G4D1T                      4553
#define CLC4GLS3_G4D1T                4554
#define LC4G4D2N                      4555
#define CLC4GLS3_G4D2N                4556
#define LC4G4D2T                      4557
#define CLC4GLS3_G4D2T                4558
#define CLC4GLS3_G4D3N                4559
#define LC4G4D3N                      4560
#define CLC4GLS3_G4D3T                4561
#define LC4G4D3T                      4562
#define LC4G4D4N                      4563
#define CLC4GLS3_G4D4N                4564
#define LC4G4D4T                      4565
#define CLC4GLS3_G4D4T                4566
#define STATUS_SHAD                   4567
#define C_SHAD                        4568
#define DC_SHAD                       4569
#define Z_SHAD                        4570
#define WREG_SHAD                     4571
#define BSR_SHAD                      4572
#define PCLATH_SHAD                   4573
#define FSR0L_SHAD                    4574
#define FSR0H_SHAD                    4575
#define FSR1L_SHAD                    4576
#define FSR1H_SHAD                    4577
#define STKPTR                        4578
#define TOSL                          4579
#define TOSH                          4580

#endif // _PIC16LF1778_H_
